define("desktop:widget/zm-achievement-map-new/zm-achievement-map.js", function (e) {
    var a = e("common:widget/echarts/echarts.js"), n = e("common:widget/jquery/1.11.3/jquery.js");
    e("common:widget/echarts/china.js");
    var m = a.init(document.getElementById("zm-achievement-map")), l = function () {
        return JSON.parse('[{"name":"上海","value":[121.48,31.22,125,"赵*佑 , 辅导8个月 , 701分，录取清华大学，数学提高30分"]},{"name":"攀枝花","value":[101.718637,26.582347,125,"冯*泽 , 辅导8个月 , 668分，录取浙江大学，语文提高24分"]},{"name":"威海","value":[122.1,37.5,125,"朱*怡 , 辅导12个月 , 674分，录取上海交通大学，英语提高28分"]},{"name":"承德","value":[117.93,40.97,125,"俞* , 辅导8个月 , 691分，录取人民大学，物理提高36分"]},{"name":"厦门","value":[118.1,24.46,126,"丁*文 , 辅导8个月 , 658分，录取华中科技大学，物理提高21分"]},{"name":"即墨","value":[120.45,36.38,130,"邢* , 辅导12个月 , 611分，录取武汉大学，数学提高34分"]},{"name":"揭阳","value":[116.35,23.55,134,"鲁* , 辅导12个月 , 652分，录取厦门大学，化学提高28分"]},{"name":"葫芦岛","value":[120.836932,40.711052,135,"祁* , 辅导8个月 , 664分，录取同济大学，历史提高29分"]},{"name":"常熟","value":[120.74,31.64,136,"孔*东 , 辅导6个月 , 651分，录取南京大学，数学提高35分"]},{"name":"惠州","value":[114.4,23.09,137,"乐* , 辅导6个月 , 734分，录取复旦大学，化学提高27分"]},{"name":"蓬莱","value":[120.75,37.8,137,"高* , 辅导12个月 , 597分，录取中国传媒大学，英语提高23分"]},{"name":"韶关","value":[113.62,24.84,138,"伍*佳 , 辅导8个月 , 651分，录取武汉大学，语文提高20分"]},{"name":"嘉峪关","value":[98.289152,39.77313,138,"戚*敏 , 辅导18个月 , 667分，录取浙江大学，地理提高26分"]},{"name":"广州","value":[113.23,23.16,138,"房* , 辅导6个月 , 628分，录取北京航空航天大学，物理提高37分"]},{"name":"延安","value":[109.47,36.6,138,"包* , 辅导12个月 , 730分，录取复旦大学医学院，化学提高33分"]},{"name":"昆明","value":[102.73,25.04,139,"肖*晴 , 辅导8个月 , 638分，录取同济大学，化学提高25分"]},{"name":"寿光","value":[118.73,36.86,140,"杨*予 , 辅导12个月 , 730分，录取北京大学，数学提高29分"]},{"name":"江门","value":[113.06,22.61,145,"钱*晖 , 辅导6个月 , 598分，录取厦门大学，历史提高22分"]},{"name":"章丘","value":[117.53,36.72,145,"陈*辰 , 辅导6个月 , 658分，录取华东师范大学，物理提高37分"]},{"name":"临汾","value":[111.5,36.08,147,"李*媛 , 辅导8个月 , 614分，录取南开大学，英语提高20分"]},{"name":"嘉兴","value":[120.76,30.77,151,"刘* , 辅导4个月 , 639分，录取武汉大学，地理提高31分"]},{"name":"长春","value":[125.35,43.88,151,"秦* , 辅导12个月 , 664分，录取北京师范大学，语文提高35分"]},{"name":"泸州","value":[105.39,28.91,157,"曹*晨 , 辅导4个月 , 646分，录取南京大学，英语提高29分"]},{"name":"西宁","value":[101.74,36.56,157,"谢*佳 , 辅导6个月 , 591分，录取中山大学，数学提高24分"]},{"name":"宜宾","value":[104.56,29.77,158,"苏* , 辅导6个月 , 634分，录取上海财经大学，物理提高36分"]},{"name":"呼和浩特","value":[111.65,40.82,158,"韦*瑶 , 辅导4个月 , 649分，录取同济大学，化学提高40分"]},{"name":"成都","value":[104.06,30.67,58,"任* , 辅导12个月 , 661分，录取上海交通大学，物理提高34分"]},{"name":"张家界","value":[110.479191,29.117096,59,"夏* , 辅导4个月 , 636分，录取哈尔滨工业大学，历史提高27分"]},{"name":"宜兴","value":[119.82,31.36,59,"余*悦 , 辅导6个月 , 657分，录取中央财经大学，语文提高35分"]},{"name":"北海","value":[109.12,21.49,60,"左* , 辅导12个月 , 657分，录取上海交通大学，地理提高22分"]},{"name":"西安","value":[108.95,34.27,61,"王*怡 , 辅导6个月 , 中考总分提高150分"]},{"name":"克拉玛依","value":[84.77,45.59,72,"杨*楠 , 辅导12个月 , 中考数学提高35分"]},{"name":"焦作","value":[113.21,35.24,75,"张*腾 , 辅导4个月 , 中考全区第1名，录取省重点高中"]},{"name":"北京","value":[116.46,39.92,79,"姜* , 辅导4个月 , 中考数学150分（满分）"]},{"name":"徐州","value":[117.2,34.26,79,"叶*澜 , 辅导12个月 , 中考600分（满分630）"]},{"name":"衡水","value":[115.72,37.72,80,"吴* , 辅导4个月 , 中考语文提高25分"]},{"name":"包头","value":[110,40.58,80,"方* , 辅导8个月 , 中考物理、化学合卷130分（满分150分）"]},{"name":"乌鲁木齐","value":[87.68,43.77,84,"吴*杰 , 辅导18个月 , 中考英语118分（满分120分）"]},{"name":"温州","value":[120.65,28.01,95,"贺* , 辅导4个月 , 中考语文作文满分"]},{"name":"九江","value":[115.97,29.71,96,"范*琦 , 辅导12个月 , 中考630分（满分660分）"]},{"name":"邯郸","value":[114.47,36.6,98,"钱* , 辅导4个月 , 中考英语提高25分"]},{"name":"临安","value":[119.72,30.23,99,"黄* , 辅导18个月 , 中考数学提高40分"]},{"name":"沧州","value":[116.83,38.33,100,"蔡* , 辅导4个月 , 英语竞赛全市1等奖"]},{"name":"荆州","value":[112.239741,30.335165,27,"罗*莹 , 辅导8个月 , 中考525分（满分550分）"]},{"name":"宜昌","value":[111.3,30.7,30,"万*圆 , 辅导12个月 , 中考成绩位列全校第1名"]},{"name":"义乌","value":[120.06,29.32,32,"李*明 , 辅导8个月 , 中考数学提高35分"]},{"name":"株洲","value":[113.16,27.83,43,"于* , 辅导6个月 , 数学竞赛全省1等奖，提前保送省重点高中"]},{"name":"石家庄","value":[114.48,38.03,47,"孙*莹 , 辅导12个月 , 中考语文提高20分"]},{"name":"莱芜","value":[117.67,36.19,48,"王* , 辅导4个月 , 中考总分提高138分"]},{"name":"常德","value":[111.69,29.05,52,"王*强 , 辅导8个月 , 中考成绩位列全校第3名"]},{"name":"保定","value":[115.48,38.85,53,"张*泽 , 辅导4个月 , 中考英语提高30分"]},{"name":"湘潭","value":[112.91,27.87,54,"葛* , 辅导12个月 , 中考数学提高35分"]},{"name":"金华","value":[119.64,29.12,57,"戴*轩 , 辅导6个月 , 中考610分（满分680）"]},{"name":"岳阳","value":[113.09,29.37,69,"刘*宁 , 辅导4个月 , 中考物理、化学合卷127分（满分150分）"]},{"name":"长沙","value":[113,28.21,75,"张*强 , 辅导8个月 , 物理竞赛全省2等奖"]},{"name":"廊坊","value":[116.7,39.53,93,"胡* , 辅导18个月 , 中考语文提高20分"]},{"name":"合肥","value":[117.27,31.86,109,"钟* , 辅导8个月 , 中考成绩位列全校第2名"]},{"name":"武汉","value":[114.31,30.52,120,"赵* , 辅导6个月 , 中考总分提高127分"]},{"name":"大庆","value":[125.03,46.58,120,"洪*思 , 辅导12个月 , 中考540分（满分590）"]}]')
    }, u = {
        backgroundColor: "inherit",
        tooltip: {
            transitionDuration: 0, position: function (e, a, m, l) {
                var u = n(m).innerWidth(), v = n("#tipArrow");
                return v.length || (v = n(m).append('<span id="tipArrow"></span>').children()), v.css({left: u / 2 - 8}), [l.x + l.width / 2 - u / 2, l.y - 45]
            }, backgroundColor: "#c00131", trigger: "item", formatter: function (e) {
                return e.value[3]
            }
        },
        geo: {
            map: "china2",
            label: {emphasis: {show: !1}},
            itemStyle: {
                normal: {areaColor: "#191d24", borderColor: "#13161b", borderWidth: 2},
                emphasis: {areaColor: "#191d24", borderWidth: 2}
            },
            zoom: 1.1,
            top: 40
        },
        series: [{
            name: "pm2.5",
            type: "scatter",
            coordinateSystem: "geo",
            data: l(),
            symbolSize: function (e) {
                return e[2] / 10
            },
            label: {normal: {show: !1}, emphasis: {show: !1}},
            itemStyle: {normal: {color: "#c00131"}, emphasis: {borderColor: "#131620", borderWidth: 2}}
        }]
    };
    m.setOption(u)
});